src/Catalogs/КаталогПредметовСнабжения/КаталогПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогПредметовСнабжения</name>
  <attributes>
    <name>НомерОСК</name>
    <comment>Номер в каталоге ОСК</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обозначение</name>
    <comment>№ чертежа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеТранслитированное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УтвержденноеНаименование</name>
    <comment>Утвержденное наименование на русском</comment>
    <type>
      <types>CatalogRef.УтвержденныеНаименованияПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельнаяПоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНаПоставку</name>
    <comment>ТУ, ГОСТ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.ТипДокументацииДляИзготовленияИПоставкиПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>NSN</name>
    <comment>Номер по системе кодификации НАТО</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.ПредметыСнабженияНАТО</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕКПС</name>
    <type>
      <types>CatalogRef.ЕКПС</types>
    </type>
  </attributes>
  <attributes>
    <name>INCAT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурныйНомерВМФ</name>
    <comment>Номер по базе Юпитер-СТО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПД2</name>
    <type>
      <types>CatalogRef.ОКПД2</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПрошивки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрошивки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаписейСправочниковИКаталогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодСнятияСПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаУпаковкиТранспортировкиХранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоСтруктуре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шифр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФНН</name>
    <comment>Федеральный номенклатурный номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШифрТранслитированный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзготовителиИПоставщики</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изготовитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокиИзготовления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПроизводства</name>
      <type>
        <types>CatalogRef.СостоянияПроизводстваПС</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗамены</name>
      <type>
        <types>CatalogRef.ТипыЗаменыПредметаСнабженияАналогом</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображениеДляЗаказчика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеИзКСУНСИ</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/КодыINCATПредставление/КодыINCATПредставление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КодыINCATПредставление</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/СтруктураЗаказаПоКомплектующимИзделиямИЗИП/СтруктураЗаказаПоКомплектующимИзделиямИЗИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураЗаказаПоКомплектующимИзделиямИЗИП</name>
  <comment>Электронная структура комплектующих изделий и ЗИП корабля</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Заказы</owners>
  <attributes>
    <name>Тип</name>
    <type>
      <types>CatalogRef.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля</types>
    </type>
  </attributes>
  <attributes>
    <name>Заведование</name>
    <type>
      <types>CatalogRef.БоевыеЧасти</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <comment>Используется для элементов с типом &quot;Группа изделий&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредметСнабжения</name>
    <comment>Используется для элементов с типами &quot;Изделие&quot; и &quot;ЗИП&quot;</comment>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Используется для элементов с типами &quot;Изделие&quot; и &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПБорт</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПБаза</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПДЭ</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПР</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПрошивки</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрошивки</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленИзСпецификации</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;. Значение Истина означает программное создание при обработке изменений спецификации предмета снабжения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоставляющейЧасти</name>
    <type>
      <types>CatalogRef.РазделыСпецификацииЗИП</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПозицииСпецификации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеДоп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПодчиненные</name>
    <comment>признак того, что элемент является родителем</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/КаталогПредметовСнабжения/Forms/ФормаВыбораРасширенная/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВыборДляКонтракта") Тогда
		
		ВыборДляКонтракта = Истина;
		
		Элементы.ГруппаОтборы.Видимость = Истина;
		
		Если Параметры.Свойство("Поставщик") Тогда
			
			Элементы.ИспользоватьОтборПоПоставщику.Видимость = Истина;
			Элементы.Поставщик.Видимость = Истина;
			
			//ИспользоватьОтборПоПоставщику = Истина;
			Поставщик = Параметры.Поставщик;	
			
		КонецЕсли;
		
		НастроитьОтбор();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоПоставщикуПриИзменении(Элемент)
	
	Если Не ИспользоватьОтборПоПоставщику Или ИспользоватьОтборПоПоставщику И ЗначениеЗаполнено(Поставщик) Тогда
	
		НастроитьОтбор();	
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоЗаказуПриИзменении(Элемент)
	
	Если Не ИспользоватьОтборПоЗаказу Или ИспользоватьОтборПоЗаказу И ЗначениеЗаполнено(Заказ) Тогда
	
		НастроитьОтбор();	
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоВидуПриИзменении(Элемент)
	
	Если Не ИспользоватьОтборПоВиду Или ИспользоватьОтборПоВиду И ЗначениеЗаполнено(Вид) Тогда
	
		НастроитьОтбор();	
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	
	Если ИспользоватьОтборПоПоставщику Тогда
	
		НастроитьОтбор();	
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	
	Если ИспользоватьОтборПоЗаказу Тогда
	
		НастроитьОтбор();	
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	Если ИспользоватьОтборПоВиду Тогда
	
		НастроитьОтбор();	
	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтбор()
	
	УстановитьПараметрПоставщик = ИспользоватьОтборПоПоставщику И ЗначениеЗаполнено(Поставщик);
	УстановитьПараметрЗаказ 	= ИспользоватьОтборПоЗаказу И ЗначениеЗаполнено(Заказ);
	УстановитьПараметрВид 		= ИспользоватьОтборПоВиду И ЗначениеЗаполнено(Вид);
	
	Если Не УстановитьПараметрПоставщик И Не УстановитьПараметрЗаказ И Не УстановитьПараметрВид Тогда
	
		Список.ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СправочникКаталогПредметовСнабжения.Ссылка КАК Ссылка,
		|	СправочникКаталогПредметовСнабжения.Наименование КАК НаименованиеРус,
		|	СправочникКаталогПредметовСнабжения.Обозначение КАК Обозначение,
		|	СправочникКаталогПредметовСнабжения.ОбозначениеТранслитированное КАК ОбозначениеТранслитированное,
		|	СправочникКаталогПредметовСнабжения.СамостоятельнаяПоставка КАК СамостоятельнаяПоставка,
		|	СправочникКаталогПредметовСнабжения.ДокументНаПоставку КАК ДокументНаПоставку,
		|	СправочникКаталогПредметовСнабжения.ФНН КАК ФНН,
		|	СправочникКаталогПредметовСнабжения.NSN КАК NSN,
		|	ЕСТЬNULL(КодыINCATПредставление.Представление, """") КАК INCAT,
		|	СправочникКаталогПредметовСнабжения.НоменклатурныйНомерВМФ КАК НоменклатурныйНомерВМФ,
		|	СправочникКаталогПредметовСнабжения.ОКПД2 КАК ОКПД2,
		|	СправочникКаталогПредметовСнабжения.ТНВЭД КАК ТНВЭД,
		|	СправочникКаталогПредметовСнабжения.Статус КАК Статус,
		|	СправочникКаталогПредметовСнабжения.ЕКПС КАК ЕКПС,
		|	ПОДСТРОКА(СправочникКаталогПредметовСнабжения.Наименование, 1, 1) КАК ГруппировкаПоАлфавиту,
		|	ТабЕКПС.Родитель КАК ЕКПСРодитель
		|ИЗ
		|	Справочник.КаталогПредметовСнабжения КАК СправочникКаталогПредметовСнабжения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕКПС КАК ТабЕКПС
		|		ПО СправочникКаталогПредметовСнабжения.ЕКПС = ТабЕКПС.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыINCATПредставление КАК КодыINCATПредставление
		|		ПО СправочникКаталогПредметовСнабжения.Ссылка = КодыINCATПредставление.ПредметСнабжения";		
	
	Иначе
		
		МассивТекстаЗапроса = Новый Массив;
		
		МассивТекстаЗапроса.Добавить("ВЫБРАТЬ");
		
		Если УстановитьПараметрЗаказ Или УстановитьПараметрВид Тогда
		
			МассивТекстаЗапроса.Добавить(" РАЗЛИЧНЫЕ");	
		
		КонецЕсли;
		
		МассивТекстаЗапроса.Добавить("
		|		СправочникКаталогПредметовСнабжения.Ссылка КАК Ссылка,
		|		СправочникКаталогПредметовСнабжения.Наименование КАК НаименованиеРус,
		|		СправочникКаталогПредметовСнабжения.Обозначение КАК Обозначение,
		|		СправочникКаталогПредметовСнабжения.ОбозначениеТранслитированное КАК ОбозначениеТранслитированное,
		|		СправочникКаталогПредметовСнабжения.СамостоятельнаяПоставка КАК СамостоятельнаяПоставка,
		|		СправочникКаталогПредметовСнабжения.ДокументНаПоставку КАК ДокументНаПоставку,
		|		СправочникКаталогПредметовСнабжения.ФНН КАК ФНН,
		|		СправочникКаталогПредметовСнабжения.NSN КАК NSN,
		|		ЕСТЬNULL(КодыINCATПредставление.Представление, """") КАК INCAT,
		|		СправочникКаталогПредметовСнабжения.НоменклатурныйНомерВМФ КАК НоменклатурныйНомерВМФ,
		|		СправочникКаталогПредметовСнабжения.ОКПД2 КАК ОКПД2,
		|		СправочникКаталогПредметовСнабжения.ТНВЭД КАК ТНВЭД,
		|		СправочникКаталогПредметовСнабжения.Статус КАК Статус,
		|		СправочникКаталогПредметовСнабжения.ЕКПС,
		|		СправочникКаталогПредметовСнабжения.ЕКПС.Родитель КАК ЕКПСРодитель,
		|		ПОДСТРОКА(СправочникКаталогПредметовСнабжения.Наименование, 1, 1) КАК ГруппировкаПоАлфавиту");
		
		Если УстановитьПараметрЗаказ Тогда
		
			МассивТекстаЗапроса.Добавить(",
			|		СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Владелец КАК Владелец");	
		
		КонецЕсли;
		
		Если УстановитьПараметрВид Тогда
		
			МассивТекстаЗапроса.Добавить(",
			|		СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ТипСоставляющейЧасти КАК ТипСоставляющейЧасти");	
		
		КонецЕсли;
		
		МассивТекстаЗапроса.Добавить("
		|	ИЗ
		|		Справочник.КаталогПредметовСнабжения КАК СправочникКаталогПредметовСнабжения");
		
		Если УстановитьПараметрЗаказ Или УстановитьПараметрВид Тогда
		
			МассивТекстаЗапроса.Добавить("
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП КАК СтруктураЗаказаПоКомплектующимИзделиямИЗИП
			|			ПО СправочникКаталогПредметовСнабжения.Ссылка = СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения");
		
		КонецЕсли;
		
		МассивТекстаЗапроса.Добавить("
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыINCATПредставление КАК КодыINCATПредставление
		|		ПО СправочникКаталогПредметовСнабжения.Ссылка = КодыINCATПредставление.ПредметСнабжения");		
		
		МассивТекстаЗапроса.Добавить("
		|	ГДЕ
		|		ИСТИНА");
		
		Если УстановитьПараметрПоставщик Тогда
		
			МассивТекстаЗапроса.Добавить("
			|			
			|И СправочникКаталогПредметовСнабжения.Ссылка В 
			|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			КаталогПредметовСнабженияИзготовителиИПоставщики.Ссылка КАК Ссылка
			|		ИЗ
			|			Справочник.КаталогПредметовСнабжения.ИзготовителиИПоставщики КАК КаталогПредметовСнабженияИзготовителиИПоставщики
			|		ГДЕ
			|			КаталогПредметовСнабженияИзготовителиИПоставщики.Контрагент = &Поставщик)");	
			
		КонецЕсли;
		
		Если УстановитьПараметрЗаказ Тогда
		
			МассивТекстаЗапроса.Добавить("
			|	И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Владелец = &Заказ");	
		
		КонецЕсли;
		
		Если УстановитьПараметрВид Тогда
		
			МассивТекстаЗапроса.Добавить("
			|	И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ТипСоставляющейЧасти = &Вид");	
		
		КонецЕсли;
		
		Список.ТекстЗапроса = СтрСоединить(МассивТекстаЗапроса);
		
		УстановитьПараметрыСписка(УстановитьПараметрПоставщик, УстановитьПараметрЗаказ, УстановитьПараметрВид);
		
	КонецЕсли;
	
	Список.УстановитьОбязательноеИспользование("Ссылка", Истина);

КонецПроцедуры // НастроитьОтбор()

&НаСервере
Процедура УстановитьПараметрыСписка(УстановитьПараметрПоставщик = Ложь, УстановитьПараметрЗаказ = Ложь, УстановитьПараметрВид = Ложь)

	Если УстановитьПараметрПоставщик Тогда
	
		Список.Параметры.УстановитьЗначениеПараметра("Поставщик", Поставщик);	
	
	КонецЕсли;
	
	Если УстановитьПараметрЗаказ Тогда
	
		Список.Параметры.УстановитьЗначениеПараметра("Заказ", Заказ);	
	
	КонецЕсли;
	
	Если УстановитьПараметрВид Тогда
	
		Список.Параметры.УстановитьЗначениеПараметра("Вид", Вид);	
	
	КонецЕсли;

КонецПроцедуры // УстановитьПараметрыСписка()

&НаКлиенте
Процедура ВыбратьПредметСнабжения(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
	
		Закрыть(ТекущиеДанные.Ссылка);	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(Элементы.Список.ТекущиеДанные.Ссылка);	
	
КонецПроцедуры
